org/stats.org
#+STARTUP: showall
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:t todo:nil tasks:("IN-PROGRESS" "DONE")
#+LAYOUT: post
#+AUTHOR: Manoel Vilela
#+DATE: 2019-03-07 Thu 22:24
#+TITLE: Fundamentos de Estatística
#+DESCRIPTION: Revisão de Fundamentos de Estatística
#+TAGS: mathematics,datascience
#+CATEGORIES: mathematics

* Capítulo I: Modelagem Probabilística

Este capítulo refere-se como uma contextualização do uso prático de
probabilidade na engenharia.
** DONE Modelos Determinísticos
   CLOSED: [2017-09-11 Mon 09:30] SCHEDULED: <2017-09-10 Sun>

Modelos determinísticos tem a propriedade que não há fatores de
aleatoriedade no processo de modelagem da solução. Sua resposta sempre
se aproxima de maneira ótima para o problema e é previsível em
qualquer caso. Conhecidos modelos determinísticos são as análises da
física newtoniana, como dinâmica e cinemática. Conhecendo os valores
iniciais, é possível descrever a evolução de um sistema em condições
ideais.

Outro modelo conhecido por ser determinístico é o modelo matemático
envolvido nos circuitos elétricos. Como a lei de Ohm \(v = RI\).  Em
condições ideais, a resposta exata do sistema avaliado é descrito
pelas equações que regem o modelo.

É importante lembrar que um modelo matemático é comumente referenciado
como um sistema para descrever algo mensurável, que se assemelha a
algo real — como é o caso da física newtoniana e a teoria de circuitos
elétricos.

** DONE Modelos Probabilísticos
   CLOSED: [2017-09-11 Mon 10:07] SCHEDULED: <2017-09-10 Sun>

Muitos sistemas de interesse envolvem comportamentos imprevisíveis e
aleatórios. Esses sistemas não podem ser descritos com modelos
determinísticos, pois dependem de fatores
não-determinísticos. Experimentos aleatórios, como o fato de lançar
uma moeda, transmissão de pacotes, tempo de espera em uma fila... são
problemas com natureza aleatória. Não é possível modelar esse tipo de
problema com modelos determinísticos.

Nesse momento então surge um novo tipo de matemática que lidaremos
como Probabilidade e Estatística. No decorrer do livro, entraremos em
conceitos mais abstratos como o de /Random Processes/ (Processos
Estocásticos).

Os meios de comunicação da internet, assim como seus protocolos, são
bons exemplos de sistemas modelados com modelos probabilísticos. Não é
possível, por exemplo, saber de exato se um pacote ao ser enviado será
chegado ao destinatário. Temos uma probabilidade que isso ocorra e uma
determinada probabilidade relacionada a quantidade de vezes
necessárias que um pacote seja enviado até que ele tenha sucesso.

* Capítulo II: Fundamentação de Probabilidade

Conceitos básicos de probabilidade, axiomas, teoremas e implicações.


** DONE Axiomas
   CLOSED: [2017-09-11 Mon 10:40] SCHEDULED: <2017-09-10 Sun>

Seja \(P\) o operador de probabilidade, \(A\) e \(B\) eventos do
espaço amostral \(S\), é dado os seguintes axiomas no contexto de
probabilidade:

1. \(0 \leq P[A] \leq 1\)
2. \(P[S] = 1\)
3. Se A e B são eventos que não acontecem simultaneamente, então
   \(P[A \cup B] = P[A] + P[B]\)

Uma extensão do axioma 3 é para o caso que tenhamos um conjunto
enumerável de eventos que são mutuamente exclusivos, então a
probabilidade de todos eles é a soma das suas probabilidades
individuais.

Um colorário interessante é o da probabilidade complemento:

#+BEGIN_LATEX latex
\begin{equation}
P[A^c] =1 - P[A]
\end{equation}
#+END_LATEX

Usualmente a operação de complemento pode ser vista como a negação da
proposição que se avalia a probabilidade. Por exemplo: qual a
probabilidade de se jogar um dado e não aparecer o número 6? Ao
aplicar esse teorema o problema fica simples \(1 - \dfrac{1}{6}
\Rightarrow \dfrac{5}{6}\) dado que a probabilidade de aparecer
qualquer número em um dado é \(\dfrac{1}{6}\)

** DONE Eventos Independentes
   CLOSED: [2017-09-11 Mon 10:44] SCHEDULED: <2017-09-10 Sun>

Se dois eventos são independentes, como o ato de lançar duas moedas, a
intersecção de suas probabilidades devem ser igual ao produto das
probabilidades dos eventos.

#+BEGIN_LATEX latex
\begin{equation}
P(A \cap B) = P(A) \cdot P(B)
\end{equation}
#+END_LATEX

Um exemplo de eventos independentes é quando o estado anterior de um
evento ocorrido não interfere na probabilidade do próximo evento
ocorrer.  Por exemplo, duas moedas sendo lançadas ao mesmo tempo são
eventos independentes.  O que ocorrer em uma não depende de outra.

No entanto, por outro lado, a probabilidade de tirar uma carta \(X\)
num deque de 52 cartas sem reposição e tirar outra \(Y\) não são
eventos independentes.

** DONE Eventos Mutualmente Exclusivos
   CLOSED: [2017-09-11 Mon 10:45] SCHEDULED: <2017-09-11 Mon>

Se dois eventos \(A\) e \(B\) não podem ocorrer simultaneamente, então
temos duas propriedades:

#+BEGIN_LATEX latex
\begin{align}
P[A \cap B] &= 0 \\ P[A \cup B] &= P[A] + P[B]
\end{align}
#+END_LATEX

Isso se deve pelo tipo de experimento que ocorre. Em alguns casos, um
evento não pode ocorrer simultaneamente. Como o caso de um moeda ser
cara e coroa ao mesmo tempo, um carro ser verde e amarelo ao mesmo
tempo.  São eventos impossíveis, por isso a probabilidade é zero
(intuitivamente).  Muitas provas existem sobre esses colorários dos
axiomas da probabilidade, mas estão fora do escopo dessas notas — a
não ser quando for interessante demonstrar.

#+BEGIN_LATEX latex
\begin{align}
P[A \cup B] &= P[A] + P[B] - P[A \cap B]
\end{align}
#+END_LATEX


** DONE Probabilidade Condicional
   CLOSED: [2017-09-11 Mon 10:55] SCHEDULED: <2017-09-10 Sun>

A probabilidade condicional pode ser enxergada como uma nova base do
*espaço amostral* em cima de uma nova condição. É anunciado que \(P(A
\mid B)\) como: 'Probabilidade de A, dado que B já ocorreu'. Ou
simplesmente 'P de A dado B'.  A fórmula para seu cálculo é dado por:

#+BEGIN_LATEX latex
\begin{equation}
P[A \mid B] = \dfrac{P[A \cap B]}{P[B]}
\end{equation}
#+END_LATEX

Probabilidade condicional é usado quando estamos se referindo a
eventos dependentes. Um bom exemplo, como comentado anteriormente, é a
probabilidade de duas cartas escolhidas sequencialmente serem
advinhadas num deque de cartas.

** DONE Experimentos Sequenciais
   CLOSED: [2017-09-11 Mon 10:59] SCHEDULED: <2017-09-10 Sun>

Experimentos sequenciais nada mais são que eventos aplicados um depois
do outro.  Sua probabilidade depende se os eventos são dependentes ou
não. Para eventos independentes podemos aplicar simplesmente a regra
do produto, a probabilidade dos eventos ocorrerem é o produtório das
probabilidades desses eventos.

No entanto, se os eventos são dependentes, devemos ter mais cautela.

** DONE Probabilidade Binomial
   CLOSED: [2017-09-11 Mon 11:12] SCHEDULED: <2017-09-11 Mon>

A lei da probabilidade binomial descreve como a probabilidade de um
experimento evolui de acordo com o número de eventos sequenciais.

#+BEGIN_LATEX latex
\begin{equation}
p_n(k) = \binom{n}{k}p^k(n -p)^{n-k}
\end{equation}
#+END_LATEX

