_posts/2019-03-07-stats.html
---
date: 2019-03-07 22:24
author: Manoel Vilela
layout: post
title: Fundamentos de Estatística
excerpt: Revisão de Fundamentos de Estatística
tags: 
categories: 
- mathematics
---
<div id="outline-container-orge0b9114" class="outline-2">
<h2 id="orge0b9114">Capítulo I: Modelagem Probabilística</h2>
<div class="outline-text-2" id="text-orge0b9114">
<p>
Este capítulo refere-se como uma contextualização do uso prático de
probabilidade na engenharia.
</p>
</div>
<div id="outline-container-org692f043" class="outline-3">
<h3 id="org692f043">Modelos Determinísticos</h3>
<div class="outline-text-3" id="text-org692f043">
<p>
Modelos determinísticos tem a propriedade que não há fatores de
aleatoriedade no processo de modelagem da solução. Sua resposta sempre
se aproxima de maneira ótima para o problema e é previsível em
qualquer caso. Conhecidos modelos determinísticos são as análises da
física newtoniana, como dinâmica e cinemática. Conhecendo os valores
iniciais, é possível descrever a evolução de um sistema em condições
ideais.
</p>

<p>
Outro modelo conhecido por ser determinístico é o modelo matemático
envolvido nos circuitos elétricos. Como a lei de Ohm \(v = RI\).  Em
condições ideais, a resposta exata do sistema avaliado é descrito
pelas equações que regem o modelo.
</p>

<p>
É importante lembrar que um modelo matemático é comumente referenciado
como um sistema para descrever algo mensurável, que se assemelha a
algo real — como é o caso da física newtoniana e a teoria de circuitos
elétricos.
</p>
</div>
</div>

<div id="outline-container-orge372e4a" class="outline-3">
<h3 id="orge372e4a">Modelos Probabilísticos</h3>
<div class="outline-text-3" id="text-orge372e4a">
<p>
Muitos sistemas de interesse envolvem comportamentos imprevisíveis e
aleatórios. Esses sistemas não podem ser descritos com modelos
determinísticos, pois dependem de fatores
não-determinísticos. Experimentos aleatórios, como o fato de lançar
uma moeda, transmissão de pacotes, tempo de espera em uma fila&#x2026; são
problemas com natureza aleatória. Não é possível modelar esse tipo de
problema com modelos determinísticos.
</p>

<p>
Nesse momento então surge um novo tipo de matemática que lidaremos
como Probabilidade e Estatística. No decorrer do livro, entraremos em
conceitos mais abstratos como o de <i>Random Processes</i> (Processos
Estocásticos).
</p>

<p>
Os meios de comunicação da internet, assim como seus protocolos, são
bons exemplos de sistemas modelados com modelos probabilísticos. Não é
possível, por exemplo, saber de exato se um pacote ao ser enviado será
chegado ao destinatário. Temos uma probabilidade que isso ocorra e uma
determinada probabilidade relacionada a quantidade de vezes
necessárias que um pacote seja enviado até que ele tenha sucesso.
</p>
</div>
</div>
</div>

<div id="outline-container-orge49ceea" class="outline-2">
<h2 id="orge49ceea">Capítulo II: Fundamentação de Probabilidade</h2>
<div class="outline-text-2" id="text-orge49ceea">
<p>
Conceitos básicos de probabilidade, axiomas, teoremas e implicações.
</p>
</div>


<div id="outline-container-orgfb833fd" class="outline-3">
<h3 id="orgfb833fd">Axiomas</h3>
<div class="outline-text-3" id="text-orgfb833fd">
<p>
Seja \(P\) o operador de probabilidade, \(A\) e \(B\) eventos do
espaço amostral \(S\), é dado os seguintes axiomas no contexto de
probabilidade:
</p>

<ol class="org-ol">
<li>\(0 \leq P[A] \leq 1\)</li>
<li>\(P[S] = 1\)</li>
<li>Se A e B são eventos que não acontecem simultaneamente, então
\(P[A \cup B] = P[A] + P[B]\)</li>
</ol>

<p>
Uma extensão do axioma 3 é para o caso que tenhamos um conjunto
enumerável de eventos que são mutuamente exclusivos, então a
probabilidade de todos eles é a soma das suas probabilidades
individuais.
</p>

<p>
Um colorário interessante é o da probabilidade complemento:
</p>

<div class="LATEX">
\begin{equation}
P[A^c] =1 - P[A]
\end{equation}

</div>

<p>
Usualmente a operação de complemento pode ser vista como a negação da
proposição que se avalia a probabilidade. Por exemplo: qual a
probabilidade de se jogar um dado e não aparecer o número 6? Ao
aplicar esse teorema o problema fica simples \(1 - \dfrac{1}{6}
\Rightarrow \dfrac{5}{6}\) dado que a probabilidade de aparecer
qualquer número em um dado é \(\dfrac{1}{6}\)
</p>
</div>
</div>

<div id="outline-container-orgbfc5f63" class="outline-3">
<h3 id="orgbfc5f63">Eventos Independentes</h3>
<div class="outline-text-3" id="text-orgbfc5f63">
<p>
Se dois eventos são independentes, como o ato de lançar duas moedas, a
intersecção de suas probabilidades devem ser igual ao produto das
probabilidades dos eventos.
</p>

<div class="LATEX">
\begin{equation}
P(A \cap B) = P(A) \cdot P(B)
\end{equation}

</div>

<p>
Um exemplo de eventos independentes é quando o estado anterior de um
evento ocorrido não interfere na probabilidade do próximo evento
ocorrer.  Por exemplo, duas moedas sendo lançadas ao mesmo tempo são
eventos independentes.  O que ocorrer em uma não depende de outra.
</p>

<p>
No entanto, por outro lado, a probabilidade de tirar uma carta \(X\)
num deque de 52 cartas sem reposição e tirar outra \(Y\) não são
eventos independentes.
</p>
</div>
</div>

<div id="outline-container-orgb6708ed" class="outline-3">
<h3 id="orgb6708ed">Eventos Mutualmente Exclusivos</h3>
<div class="outline-text-3" id="text-orgb6708ed">
<p>
Se dois eventos \(A\) e \(B\) não podem ocorrer simultaneamente, então
temos duas propriedades:
</p>

<div class="LATEX">
\begin{align}
P[A \cap B] &= 0 \\ P[A \cup B] &= P[A] + P[B]
\end{align}

</div>

<p>
Isso se deve pelo tipo de experimento que ocorre. Em alguns casos, um
evento não pode ocorrer simultaneamente. Como o caso de um moeda ser
cara e coroa ao mesmo tempo, um carro ser verde e amarelo ao mesmo
tempo.  São eventos impossíveis, por isso a probabilidade é zero
(intuitivamente).  Muitas provas existem sobre esses colorários dos
axiomas da probabilidade, mas estão fora do escopo dessas notas — a
não ser quando for interessante demonstrar.
</p>

<div class="LATEX">
\begin{align}
P[A \cup B] &= P[A] + P[B] - P[A \cap B]
\end{align}

</div>
</div>
</div>


<div id="outline-container-org38a7db9" class="outline-3">
<h3 id="org38a7db9">Probabilidade Condicional</h3>
<div class="outline-text-3" id="text-org38a7db9">
<p>
A probabilidade condicional pode ser enxergada como uma nova base do
<b>espaço amostral</b> em cima de uma nova condição. É anunciado que \(P(A
\mid B)\) como: 'Probabilidade de A, dado que B já ocorreu'. Ou
simplesmente 'P de A dado B'.  A fórmula para seu cálculo é dado por:
</p>

<div class="LATEX">
\begin{equation}
P[A \mid B] = \dfrac{P[A \cap B]}{P[B]}
\end{equation}

</div>

<p>
Probabilidade condicional é usado quando estamos se referindo a
eventos dependentes. Um bom exemplo, como comentado anteriormente, é a
probabilidade de duas cartas escolhidas sequencialmente serem
advinhadas num deque de cartas.
</p>
</div>
</div>

<div id="outline-container-orgdd0e6b3" class="outline-3">
<h3 id="orgdd0e6b3">Experimentos Sequenciais</h3>
<div class="outline-text-3" id="text-orgdd0e6b3">
<p>
Experimentos sequenciais nada mais são que eventos aplicados um depois
do outro.  Sua probabilidade depende se os eventos são dependentes ou
não. Para eventos independentes podemos aplicar simplesmente a regra
do produto, a probabilidade dos eventos ocorrerem é o produtório das
probabilidades desses eventos.
</p>

<p>
No entanto, se os eventos são dependentes, devemos ter mais cautela.
</p>
</div>
</div>

<div id="outline-container-orgaed748a" class="outline-3">
<h3 id="orgaed748a">Probabilidade Binomial</h3>
<div class="outline-text-3" id="text-orgaed748a">
<p>
A lei da probabilidade binomial descreve como a probabilidade de um
experimento evolui de acordo com o número de eventos sequenciais.
</p>

<div class="LATEX">
\begin{equation}
p_n(k) = \binom{n}{k}p^k(n -p)^{n-k}
\end{equation}

</div>
</div>
</div>
