org/stats.org
** DONE Teorema de Bayes
   CLOSED: [2017-09-11 Mon 10:01] SCHEDULED: <2017-09-10 Sun>
O teorema de Bayes, ou regra de Bayes, estabelece que o evento
condicional estão intrinsecamente ligados com a probabilidade do
evento em si ocorrer.  Isto é, a probabilidade condicional de A dado B
e B dado A, é proporcional as probabilidades de B e A.

#+BEGIN_LATEX latex
\begin{equation}
P(A \mid B) = \dfrac{P(B \mid A) P(A)}{P(B)}
\end{equation}
#+END_LATEX

Muito similar ao teorema da probabilidade condicional, o teorema de
Bayes geralmente tem sua formula descrita de forma mais sucinta
traduzindo a definição da probabilidade de \(P(A \cap \B)\) em termos
da probabilidade condicional.

Isto fica evidente quando lembramos que:

#+BEGIN_LATEX latex
\begin{equation}
P(A \cap B) = P(B \mid A)P(A) = P(A \mid B) P(B)
\end{equation}
#+END_LATEX


** DONE Teorema da Probabilidade Total
   CLOSED: [2017-09-11 Mon 11:18] SCHEDULED: <2017-09-10 Sun>

O teorema da probabilidade total referencia o teorema de Bayes com uma
especifica modelagem. Ele é enxergado com fatias do espaço amostral em
relação ao um evento de interesse. Logo, a probabilidade de um evento
\(A\) pode ser visto como a intersecção de todas essas parcelas de
eventos com nosso evento de interesse \(A\).


A partir disso tem-se que uma probabilidade qualquer \(A)\) pode ser
expressa em cima de:

#+BEGIN_LATEX latex
\begin{equation}
P[A] = \sum_{i=1}^n P[E_i \cap A] = \sum_{i=i}^n P[A \mid E_i] P[E_i]
\end{equation}
#+END_LATEX

** DONE Diagrama de Árvore
   CLOSED: [2017-09-11 Mon 09:54] SCHEDULED: <2017-09-10 Sun>

O diagrama de árvore é usado geralmente para descrever todos os
possíveis caminhos de um determinado experimento.  Como um modelo
probabilístico pode se comportar diante das variações de eventos.

Muito útil durante a análise, principalmente de eventos sequenciais,
para um caso avaliando dois lançamentos de moedas sequencias, tem-se a
seguinte possível arquitetura:

#+BEGIN_EXAMPLE
                                   _ / \
                               T H / \ / \
                            T H T H
#+END_EXAMPLE

Onde =T= significa /tail/ (coroa) e =H= /head/ (cara). Embora nesse
exemplo não pareça um tanto útil pois as probabilidades são iguais,
quando lidamos com sistemas com muitas peculiaridades, como
probabilidades condicionais pode ser bastante útil para
visualização. No entanto, é uma ferramenta visual para esclarecimento,
que pode ser muitas vezes ignorada.


* DONE Capitulo III: Variáveis aleatórias discretas
  CLOSED: [2017-09-26 ter 01:56] DEADLINE: <2017-09-14 Thu> SCHEDULED: <2017-09-12 Tue>

Bom, variáveis aleatórias discretas são definidas no contexto de
probabilidade e estatística. Uma variável aleatória nada mais é que
uma função que relaciona um evento (experimento aleatório) a um dado
número.

Para um variável aleatória ser definida, essa relação deve ser
conhecida.

Há muitos tipos de variáveis aleatórias, como variável de poison,
geométrica, bernoulli e a variável binomial. Cada uma delas são usadas
para casos distintos de problemas com natureza probabilística.

Nas próximas seções serão definidas, de uma maneira mais descritiva e
formal, as propriedades que uma variável aleatória discreta possuí.

Existe a noção de classe de eventos, que são uma coleção de
experimentos aleatório que possuí o mesmo tipo de experimento.
(como os resultados de lançar uma moeda ou um dado).

** DONE Probability Mass Function (PMF)
   CLOSED: [2017-09-24 dom 20:09]

A PMF, em português FMP, que significa função massa de probabilidade
se refere uma função de probabilidade que X assume dado valor. Sua
definição é bem tirada como pode ser visto a seguir:

#+BEGIN_LATEX latex
\begin{equation}
p_x(x) = P[X = x] = P[\{\zeta:X(\zeta) = x\}]
                    \qquad \text{for x a real number.}
\end{equation}
#+END_LATEX

Três axiomas são definidas para a PMF, dentre quais:

#+BEGIN_LATEX latex
\begin{align}
p_x(x) &\geq 0 &\text{for all x} \\
\sum_{k \in S_x} p_x(k) &= 1 \\
P[X \in B] &= \sum_{x \in B} p_x(x) &\text{where} \ B \subset S_X
\end{align}
#+END_LATEX

** DONE Distribuições
   CLOSED: [2017-09-24 dom 20:09]

Há varias tipos de distribuições para modelos de probabilidade. Cada
um desses modelos é aplicado para um determinado tipo de problema, a
seguir é comentado algum deles. Dessa maneira, uma determinada
distribuição está relacionado com uma definição de variável aleatória.

*** DONE Bernoulli
    CLOSED: [2017-09-24 dom 20:09]

Provavelmente uma das distribuições mais simples de todas, quando se
possui um problema de natureza binária, isto é, a variável aleatória
só pode assumir dois valores, então seu nome recebe como variável
aleatória de Bernoulli. Em casos, como um sistema que avalia
sucesso/falha de uma operação, é interessante usar Bernoulli. Por
exemplo \(X(E_{sucesso}) = 1\) e \(X(E_{falha}) = 0\).

*** DONE Geométrica
    CLOSED: [2017-09-24 dom 20:09]

Quando uma sequência de eventos é relacionada de forma independente
aos seus estados anteriores, essa variável é conhecida como Variável
Aleatória Geométrica. Sua forma é acontecer n eventos iguais sequencialmente,
até que o posto aconteça. É a única variável aleatória sem memória.
Um exemplo de uso dessa distribuição é a quantidade de pacotes necessários
que precisam ser enviados até que um deles chegue com sucesso.

#+BEGIN_LATEX latex
\begin{equation}
p_x(k) = P[X = k] = (1 - p)^{k-1}p = q^{k-1}p
\end{equation}
#+END_LATEX

*** DONE Binomial
    CLOSED: [2017-09-24 dom 20:09]

Semelhante ao caso da Geométrica, na binomial estamos interessados
nas possíveis combinações geradas entre os eventos. Por exemplo,
como é distribuída a probabilidade para eu obter n coroas no lançamento
de uma moeda k vezes?

A fórmula da binomial segue que:

#+BEGIN_LATEX latex
\begin{equation}
p_x(k) = P[X = k] = \binom{n}{k}p_k(1-p)^{n-k}
\end{equation}
#+END_LATEX

Outro exemplo interessante é contar a quantidade de erros numa
transmissão. Uma canal de comunicação binária introduz um bit de erro
em uma transmissão com probabilidade \(p\). Seja \(X\) o número de erros
em \(n\) independentes transmissões. Encontre a pmf de X. Encontre a
probabilidade de um ou mais erros.

A distribuição binomial é usada aqui pois pode ocorrer um erro em qualquer
uma das transmissões, embora a ordem que eles ocorreram não importam,
apenas que é possível ocorrer em qualquer das \(n\) transmissões.

Por exemplo, para \(P[X \leq 1]\) iremos somar a probabilidade de que
\(k = \{0, 1\}\).


*** DONE Poisson
    CLOSED: [2017-09-26 ter 01:55]

A variável de Poisson, uma variável discreta, é modelada
para descrever uma contagem num dado intervalo contínuo.
Ela é modelada através de uma função exponencial.

Um exemplo de uso para essa variável seria analisar quantas
pessoas chegam na estação de trem no intervalo de uma hora.

Define-se então a variável de Poisson como a seguir:

#+BEGIN_LATEX latex
\begin{equation}
P[N = k] = p_N(k) = \dfrac{\lambda^k e^{-\lambda}}{k!}
\end{equation}
#+END_LATEX


