org/stats.org
** DONE Valor esperado (Expected Value)
   CLOSED: [2017-09-24 dom 20:09]


O valor esperado ou média se refere a um valor de tendência numa distribuição
probabilística. Isto é, os valores mais prováveis de serem encontrados estão
em torno da média ou do valor esperado.

#+BEGIN_LATEX latex
\begin{equation}
E[X] = \sum_{x \in S_x} xp_x(x) = \sum_k x_k p_k(x_k)
\end{equation}
#+END_LATEX

Isto é, dado um subconjunto \(S_x\) do espaço amostral \(S\), sendo
esse subconjunto aqueles com os nossos eventos de interesse, a definição
de esperança define como a soma do produto dos individuais valores do conjunto
por sua probabilidade de ocorrer.

Para o valor esperado existir, é necessário que a soma convirja absolutamente.

** DONE Variância e Desvio Padrão
   CLOSED: [2017-09-24 dom 20:49]

A definição de variância em probabilidade estatística está relacionado
a amplitude que os valores oscilam em torno da média. Pode-se definir
de duas maneiras:

#+BEGIN_LATEX latex
\begin{equation}
\sigma_X^2 = VAR[X] = E[(X - m_x)^2] = E[X^2] - E[X]^2
\end{equation}
#+END_LATEX

Vale lembrar que a Esperança (E[X]) é um operador linear
que possuí as propriedades de superposição e homogeneidade.

O desvio padrão é denotado como a raiz quadrada da variança.
Sendo apenas \(\sigma_x\).

** DONE Momento de uma variável
   CLOSED: [2017-09-24 dom 20:49]

O momento é definido como uma propriedade referente ao valor
esperado de uma variável X. É definido como *n-ésimo momento de X*:
\(E[X^n]\).


** DONE PMF e Esperança Condicional
   CLOSED: [2017-10-23 Mon 01:09]

A PMF e Esperança condicional apenas estende os conceitos
previamente descritos com a Regra de Bayes e o Teorema da
Probabilidade Total.


* TODO Capítulo IV: Variáveis aleatórias contínuas
** TODO Cumulative Distribution Function (CDF)
  DEADLINE: <2017-09-14 Thu> SCHEDULED: <2017-09-12 Tue>
** TODO Probability Density Function (PDF)
** TODO The Expected Value of X
** TODO Distribuições Contínuas
** TODO Funções de uma variável aleatória
** TODO Inequações de Markov
** TODO Métodos de Transformada

* TODO Dúvidas

** TODO Há diferença entre Distribuição de Probabilidade e Variável Aleatória?
