_posts/2019-03-07-stats.html


<div id="outline-container-org0697236" class="outline-3">
<h3 id="org0697236">Valor esperado (Expected Value)</h3>
<div class="outline-text-3" id="text-org0697236">
<p>
O valor esperado ou média se refere a um valor de tendência numa distribuição
probabilística. Isto é, os valores mais prováveis de serem encontrados estão
em torno da média ou do valor esperado.
</p>

<div class="LATEX">
\begin{equation}
E[X] = \sum_{x \in S_x} xp_x(x) = \sum_k x_k p_k(x_k)
\end{equation}

</div>

<p>
Isto é, dado um subconjunto \(S_x\) do espaço amostral \(S\), sendo
esse subconjunto aqueles com os nossos eventos de interesse, a definição
de esperança define como a soma do produto dos individuais valores do conjunto
por sua probabilidade de ocorrer.
</p>

<p>
Para o valor esperado existir, é necessário que a soma convirja absolutamente.
</p>
</div>
</div>

<div id="outline-container-org10632e0" class="outline-3">
<h3 id="org10632e0">Variância e Desvio Padrão</h3>
<div class="outline-text-3" id="text-org10632e0">
<p>
A definição de variância em probabilidade estatística está relacionado
a amplitude que os valores oscilam em torno da média. Pode-se definir
de duas maneiras:
</p>

<div class="LATEX">
\begin{equation}
\sigma_X^2 = VAR[X] = E[(X - m_x)^2] = E[X^2] - E[X]^2
\end{equation}

</div>

<p>
Vale lembrar que a Esperança (E[X]) é um operador linear
que possuí as propriedades de superposição e homogeneidade.
</p>

<p>
O desvio padrão é denotado como a raiz quadrada da variança.
Sendo apenas \(\sigma_x\).
</p>
</div>
</div>

<div id="outline-container-orga9a12c7" class="outline-3">
<h3 id="orga9a12c7">Momento de uma variável</h3>
<div class="outline-text-3" id="text-orga9a12c7">
<p>
O momento é definido como uma propriedade referente ao valor
esperado de uma variável X. É definido como <b>n-ésimo momento de X</b>:
\(E[X^n]\).
</p>
</div>
</div>


<div id="outline-container-org8072b15" class="outline-3">
<h3 id="org8072b15">PMF e Esperança Condicional</h3>
<div class="outline-text-3" id="text-org8072b15">
<p>
A PMF e Esperança condicional apenas estende os conceitos
previamente descritos com a Regra de Bayes e o Teorema da
Probabilidade Total.
</p>
</div>
</div>
</div>
